[{"author":"Team iDiva","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/lead_masoom_idiva_980x457.jpg","info":"Masoom Minawala a.k.a Miss Style Fiesta is a millennial success story. The fashion blogger/entrepreneur founded the e-commerce website, Style Fiesta, at 21, and is currently perched atop a colossal 161k following on Instagram. Understandably, Masoom’s influence is massive, with people tracking the slightest activity on her social media pages. Last year, the blogger let her fans on in her one-of-a-kind virtual engagement that caused a mini frenzy on the platform. ","title":"We Are Obsessing Over This Indian Blogger’s Honeymoon Wardrobe","type":"trending","url":"http://www.idiva.com/news-style-beauty/we-are-obsessing-over-this-indian-bloggers-honeymoon-wardrobe/17040541"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Mar/lead_kareenatanya_idiva_980x457.jpg","info":"Behind every well-turned out leading lady, is a sleep-deprived, overworked stylist. Chances are that the outfit that does go on to dominate our feeds, at first, likely faced outright rejection by the said celebrity. And, if it wasn’t for the stylist’s cajoling, it wouldn’t have even made it as the most tweeted or Instagrammed outfit right after being shown off to the world. The fact that it does, is the work of that persuasive stylist.","title":"“Kareena Hates Tight-Fitting Dresses” And Other Bollywood Styling Secrets Revealed by Tanya Ghavri","type":"trending","url":"http://www.idiva.com/news-style-beauty/kareena-hates-tight-fitting-dresses-and-other-bollywood-styling-secrets-revealed-by-tanya-ghavri/17032741"},{"author":"Dolly Singh","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Mar/hello_awards_lead_980x457.jpg","info":"Last night was a little too bright, thanks to the chain of dazzling celebrities present at the Hello! Hall of Fame Awards. The evening was filled some rib-tickling jokes by Varun Dhawan, and speeches by leading ladies, Twinkle Khanna and Shobha De. From Mrs. Funny Bones (Twinkle)  receiving the Visionary Woman of the Year award, and Alia Bhatt bagging the Outstanding Talent of the Year award, a lot happened.","title":"5 Stunning Ladies We Spotted At The Hello! Hall Of Fame Awards","type":"trending","url":"http://www.idiva.com/news-style-beauty/5-stunning-ladies-we-spotted-at-the-hello-hall-of-fame-awards/17032990"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Mar/lead_bagbestfriend_idiva_980x457.jpg","info":"The men in my life have always found a way to mock me for having too many besties. “How can you have three best friends?” they’d quip. This was followed by a rehearsed monologue on what friendship has taught me, and how every best friend brought out a unique version of mine. Almost every time I was interrupted halfway and shushed for being indecisive about my choices. Today my count still stands at five best friends, despite distance, time, personal evolutions, and general differences. These are women who have fiercely stood by me, sometimes even replacing people who are biologically designed to love me (read family). For most of us who have the privilege of calling some very accomplished women our friends, it doesn’t hurt to express some untimely gratitude. Of course, there will never be anything that can possibly quantify all the bestselling-book-worthy camaraderie that you all share. Although you could slip in a good looking bag in this equation, as one of the many memorable things exchanged between you two, or three, or even four... ","title":"10 Bags That You Should Gift Your BFF Who Has Always Been There For You","type":"trending","url":"http://www.idiva.com/news-style-beauty/10-bags-that-you-should-gift-your-bff-who-has-always-been-there-for-you/17032622"},{"author":"Dolly Singh","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/these_recent_looks_by_kareena_kapoor_khan_are_all_sorts_of_gorgeous_980x457.jpg","info":"She may or may not star in a movie, but Kareena Kapoor Khan sure knows how to stay in the limelight. Whether it is the birth of her first child, Taimur Ali Khan, or a simple visit to the airport, the lady is always in the news. It has been years since they came out, but we still obsess over her iconic characters like Poo and Geet.","title":"These Recent Looks By Kareena Kapoor Khan Are All Sorts Of Gorgeous","type":"trending","url":"http://www.idiva.com/news-style-beauty/these-recent-looks-by-kareena-kapoor-khan-are-all-sorts-of-gorgeous/17040666"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/lead_deepika_idiva_980x457.jpg","info":"Deepika Padukone cutting a flawless picture is somewhat disconcerting for our fragile egos. If it isn’t her highlighted-to-perfection cheekbones, her wardrobe, lately, has been a reminder of our own incompetent ones. Nonetheless, in 2017 we don’t let a global superstar, who is the business of looking otherworldly, determine our worth. Instead, under the guise of inspiration, we walk off with the best of her style. In that light, we picked out the actress’ recent outfit choices and ran an online shopping marathon to replicate them. Here’s what this ego massage led to –","title":"We Tried Replicating Deepika Padukone’s Recent Looks In Less Than Rs. 5000","type":"trending","url":"http://www.idiva.com/news-style-beauty/we-tried-replicating-deepika-padukones-recent-looks-in-less-than-rs-5000/17040777"},{"author":"Dolly Singh","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/idiva_90s_header_1__980x457.jpg","info":"Between dancing to Rani Mukherji and Priety Zinta starring girl anthem, Piya Piya, and filling our walls with posters of Shah Rukh Khan and Karisma Kapoor, we managed to style ourselves up in a blue over-all, tie our hair with a scrunchie, and top it off with a sweatshirt on our waist. Looking back at our own childhood pictures we are thrown back at the memory of friendship bands that we wasted days while making, and tattoo chokers that made us feel like a part of the fashion brigade of the time. It is quite clear that 90s is no more than just a period in time, but also a huge fashion trend.","title":"9 Fashion Trends Only Kids From The 90s Kids Will Remember","type":"trending","url":"http://www.idiva.com/news-style-beauty/9-fashion-trends-only-kids-from-the-90s-kids-will-remember/17040792"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/lead_sonamkapoor_idiva_980x457.jpg","info":"She may have been a tad MIA (or smitten by her alleged main squeeze), but Sonam Kapoor is, by popular vote, the OG fashion baby. The actress has been a driving force behind many offbeat brands. Her endorsement, alone (at the airport or while on a celebrity outing), has propelled a series of such brands into the mainstream. Not a shocker, but when Sonam sports a style, it instantly climbs the ranks of a must-have. We have picked out five such brands that have seen a similar success story. ","title":"If You Love Sonam Kapoor’s Style, These 5 Brands Should Be On Your Radar","type":"trending","url":"http://www.idiva.com/news-style-beauty/if-you-love-sonam-kapoors-style-these-5-brands-should-be-on-your-radar/17040669"},{"author":"Nyma Singh Merchant","category":"Make Up","image":"http://mediaresources.idiva.com/media/content/2017/Apr/what_your_favourite_makeup_product_says_about_you_980x457.jpg","info":"Just like the way your clothes can tell a lot about who you are, your beauty products are capable of doing the same. The one beauty product that you constantly turn to, can be an indication of your mood, your personality, or a statement you're trying to make, consciously or unconsciously. Check out the list below, and see what your favourite make-up product says about you.","title":"What Your Favourite Make-Up Product Says About You","type":"latest","url":"http://www.idiva.com/news-style-beauty/what-your-favourite-make-up-product-says-about-you/17040672"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/lead_deepikaallwhite_idiva_980x457.jpg","info":"Deepika Padukone's wardrobe is the sole indicator of what's good in fashion. She, together with stylist Shaleena Nathani, has achieved a status that is, quite frankly, unattainable. Now, as we cruise through summer and definitive celebrity appearances, Deepika's recent one addresses one of our important dilemmas - how to wear all-white-everything? ","title":"Deepika Padukone Sets The Tone For The Biggest Summer Trend","type":"latest","url":"http://www.idiva.com/news-style-beauty/deepika-padukone-sets-the-tone-for-the-biggest-summer-trend/17040783"},{"author":"Dolly Singh","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/let_these_celebrities_show_you_how_to_work_a_white_t_shirt_in_5_different_ways_980x457.jpg","info":"A crisp white shirt may not be crisp when you need it, and in times like those you opt for the next best thing, the white t-shirt that needs no crisping whatsoever! A white tee is a huge wardrobe must-have, and if you do not own one yet, you must be living under a rock. The piece is not only the second half of the classic white t-shirt - blue jeans combo, but also one of the most versatile items one can own.","title":"Let These Celebrities Show You How To Work A White T-Shirt In 5 Different Ways","type":"latest","url":"http://www.idiva.com/news-style-beauty/let-these-celebrities-show-you-how-to-work-a-white-t-shirt-in-5-different-ways/17040415"},{"author":"Prachi Gangwani","category":"Beauty","image":"http://mediaresources.idiva.com/media/content/2017/Apr/card_bikiniwax_idiva_980x457.jpeg","info":"The very thought of getting a bikini wax can be intimidating and awkward. I mean, there you’ll be, half naked in front of a stranger, having your pubes pulled out in what is known to be a painful method. They don’t prep us at school for things like this. So, someone walking into a salon for their first ever bikini wax is likely to have no clue about what to expect. ","title":"10 Things That Nobody Tells You About Getting Your First Bikini Wax","type":"latest","url":"http://www.idiva.com/news-style-beauty/things-that-nobody-tells-you-about-getting-your-first-bikini-wax/17040414"},{"author":"Stuti Bhattacharya","category":"Make Up","image":"http://mediaresources.idiva.com/media/content/2017/Apr/untitled_collage_62__980x457.jpeg","info":"Aditi Rao Hydari has cool fashion chops, sure, but her signature ethnic beauty look is the one thing about her style truly worth emulating. Classic, neat, and very on-trend, it is something that can look good on anyone, and can be your go-to for any event demanding a traditional, or a boho-chic Indian vibe. To help you get her next level glow, we’ve listed out the five simple steps you need to follow to get Aditi’s look yourself.","title":"Aditi Rao Hydari's Recurring Ethnic Beauty Look Is Worth Bookmarking!","type":"latest","url":"http://www.idiva.com/news-style-beauty/aditi-rao-hydaris-recurring-ethnic-beauty-look-is-worth-bookmarking/17040387"},{"author":"Nyma Singh Merchant","category":"Make Up","image":"http://mediaresources.idiva.com/media/content/2017/Apr/pastelmakeuplead1_980x457.jpg","info":"With the advent of spring turning into summer, comes a whole new set of sartorial and beauty trends, and rules to follow. The soaring heat makes us want to ditch our otherwise go-to dark make-up, and opt for lighter, pastel colours. While pastels may not be a new trend, they tend to make an appearance around this time every year. There's something comforting about these mint, peach, and lilac hues making the heat slightly bearable. So, check out these pastel-coloured make-up products to help you through the summer.","title":"Get Your Pastel On With These Pastel-Toned Make-Up Products","type":"latest","url":"http://www.idiva.com/news-style-beauty/get-your-pastel-on-with-these-pastel-toned-make-up-products/17040396"},{"author":"Kusha Kapila","category":"Fashion","image":"http://mediaresources.idiva.com/media/content/2017/Apr/lead_aliabhatt_idiva1_980x457.jpg","info":"For those of us whose morning ritual constitutes a stare-down with their wardrobes, and a whole lot of internal screaming, it’s time to snap out of our misery. It’s also time to fully assume the responsibility of the chaos that lies behind your closet doors. You have nothing to wear? Right. Is it because you don’t own enough clothes to last you a week? Wrong! As it is with any intervention, this is the point where you will begin to call out on the many factors that, in no universe, have any correlation with the issue at hand, which is essentially, a mismanaged wardrobe. Own up, and if you are ready for it, go through this lifesaving guide to get things in order. ","title":"This Is An Intervention For The Girl Who Has Nothing To Wear, Ever","type":"latest","url":"http://www.idiva.com/news-style-beauty/this-is-an-intervention-for-the-girl-who-has-nothing-to-wear-ever/17040423"},{"author":"Stuti Bhattacharya","category":"Trends","image":"http://mediaresources.idiva.com/media/content/2017/Apr/untitled_collage_59__980x457.jpeg","info":"Music festivals are such a huge thing now that the trends spotted there, have almost become a separate category of fashion, be it in a good way, or bad (Coachella, we’re looking at you). In their own chilled-out, bohemian way, these festivals inspire new trends through celebrities and influencers like the Jenner sisters. However, this time, a very controversial new trend might be on the horizon, and it involves pasting your stash of pot in your flower crown. Yes, that’s right-- people are actually making cannabis flower crowns a thing.","title":"Trend Alert! Would You Wear Marijuana “Flower” Crowns?","type":"latest","url":"http://www.idiva.com/news-style-beauty/trend-alert-would-you-wear-marijuana-flower-crowns/17040384"}]